app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.role = 'user'
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"